MONTHS_IN_YEAR_DAYS = {
    "январь": "17",
    "февраль": "20",
    "март": "21",
    "апрель": "22",
    "май": "18",
    "июнь": "19",
    "июль": "23",
    "август": "21",
    "сентябрь": "22",
    "октябрь": "23",
    "ноябрь": "19",
    "декабрь": "22",
}

MONTHS_IN_YEAR_HOURS = {
    "январь": "122.4",
    "февраль": "144.0",
    "март": "150.2",
    "апрель": "157.4",
    "май": "129.6",
    "июнь": "135.8",
    "июль": "165.6",
    "август": "151.2",
    "сентябрь": "158.4",
    "октябрь": "165.6",
    "ноябрь": "135.8",
    "декабрь": "158.4",
}

FACTORS = {
    "Ночные 1 смена": "6",
    "Ночные 3 смена": "1.3",
    "Процент оплаты ночных": "20",
    "Премия": "40",
    "Подземные условия": "4",
    "Районный коэффициент": "30",
    "Северная надбавка": "50",
    "Доплата за температуру": "10",
    "НДФЛ": "13",
}
